# Heart Disease Prediction 

Проект по анализу медицинских данных и классификации сердечно-сосудистых заболеваний с использованием машинного обучения. В основе проекта лежит знаменитый набор данных **UCI Heart Disease Dataset**.

## Описание проекта

Цель проекта — разработать модель машинного обучения, способную прогнозировать наличие или отсутствие сердечных заболеваний у пациентов на основе их клинических и демографических показателей. Данная задача решает проблему бинарной классификации (`target`: 0 — здоров, 1 — болен).

## Описание датасета

В проекте используется Кливлендская выборка датасета UCI (303 записи). Данные содержат 14 ключевых признаков:

*   `age`: Возраст (в годах)
*   `sex`: Пол (1 = мужской, 0 = женский)
*   `cp`: Тип боли в груди (4 значения)
*   `trestbps`: Артериальное давление в покое (мм рт. ст.)
*   `chol`: Уровень холестерина в сыворотке (мг/дл)
*   `fbs`: Сахар в крови натощак > 120 мг/дл (1 = истина, 0 = ложь)
*   `restecg`: Результаты ЭКГ в покое (0, 1, 2)
*   `thalach`: Максимальная частота сердечных сокращений (ЧСС)
*   `exang`: Стенокардия при физической нагрузке (1 = да, 0 = нет)
*   `oldpeak`: Депрессия сегмента ST, вызванная нагрузкой
*   `slope`: Наклон пикового сегмента ST при нагрузке
*   `ca`: Количество крупных сосудов (0–3), окрашенных флюороскопией
*   `thal`: Результаты теста на талассемию
*   `target`: Наличие заболевания (0 = нет, 1 = да) — *целевая переменная*

## Стек технологий

*   **Язык:** Python 3.x
*   **Анализ данных и EDA:** Pandas, NumPy
*   **Визуализация:** Matplotlib, Seaborn
*   **Инженерия данных:** Feature Engine
*   **Машинное обучение:** Scikit-learn (Logistic Regression / Random Forest / DT/ LGBM)


##  Результаты работы 

*   Проведен разведочный анализ данных (EDA), выявлены ключевые корреляции
*   Обработаны пропуски и категориальные признаки.
*   Лучшая модель (**Logistic regression**) достигла точности (ROC-AUC) **~92%** (precision) **~87%** (recall) **~86%** на тестовой выборке.
